

const database = {
    list_all: [
        {
            id: 1,
            name: 'Book Number1',
            description: `Разнообразный и богатый опыт укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации. Повседневная практика показывает, что сложившаяся структура организации влечет за собой процесс внедрения и модернизации дальнейших направлений развития. Повседневная практика показывает, что реализация намеченных плановых заданий позволяет оценить значение существенных финансовых и административных условий. Идейные соображения высшего порядка, а также начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации модели развития. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности в значительной степени обуславливает создание дальнейших направлений развития.
            Задача организации, в особенности же рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании направлений прогрессивного развития. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Значимость этих проблем настолько очевидна, что консультация с широким активом обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия.`
        },
        {
            id: 2,
            name: 'Book Number2',
            description: `Разнообразный и богатый опыт укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации. Повседневная практика показывает, что сложившаяся структура организации влечет за собой процесс внедрения и модернизации дальнейших направлений развития. Повседневная практика показывает, что реализация намеченных плановых заданий позволяет оценить значение существенных финансовых и административных условий. Идейные соображения высшего порядка, а также начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации модели развития. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности в значительной степени обуславливает создание дальнейших направлений развития.
            Задача организации, в особенности же рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании направлений прогрессивного развития. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Значимость этих проблем настолько очевидна, что консультация с широким активом обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия.`
        },
        {
            id: 3,
            name: 'Book Number3',
            description: `Разнообразный и богатый опыт укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации. Повседневная практика показывает, что сложившаяся структура организации влечет за собой процесс внедрения и модернизации дальнейших направлений развития. Повседневная практика показывает, что реализация намеченных плановых заданий позволяет оценить значение существенных финансовых и административных условий. Идейные соображения высшего порядка, а также начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации модели развития. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности в значительной степени обуславливает создание дальнейших направлений развития.
            Задача организации, в особенности же рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании направлений прогрессивного развития. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Значимость этих проблем настолько очевидна, что консультация с широким активом обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия.`
        },
        {
            id: 4,
            name: 'Book Number4',
            description: `Разнообразный и богатый опыт укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации. Повседневная практика показывает, что сложившаяся структура организации влечет за собой процесс внедрения и модернизации дальнейших направлений развития. Повседневная практика показывает, что реализация намеченных плановых заданий позволяет оценить значение существенных финансовых и административных условий. Идейные соображения высшего порядка, а также начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации модели развития. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности в значительной степени обуславливает создание дальнейших направлений развития.
            Задача организации, в особенности же рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании направлений прогрессивного развития. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Значимость этих проблем настолько очевидна, что консультация с широким активом обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия.`
        },
        {
            id: 5,
            name: 'Book Number5',
            description: `Разнообразный и богатый опыт укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации. Повседневная практика показывает, что сложившаяся структура организации влечет за собой процесс внедрения и модернизации дальнейших направлений развития. Повседневная практика показывает, что реализация намеченных плановых заданий позволяет оценить значение существенных финансовых и административных условий. Идейные соображения высшего порядка, а также начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации модели развития. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности в значительной степени обуславливает создание дальнейших направлений развития.
            Задача организации, в особенности же рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании направлений прогрессивного развития. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Значимость этих проблем настолько очевидна, что консультация с широким активом обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия.`
        },
        {
            id: 6,
            name: 'Book Number6',
            description: `Разнообразный и богатый опыт укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации. Повседневная практика показывает, что сложившаяся структура организации влечет за собой процесс внедрения и модернизации дальнейших направлений развития. Повседневная практика показывает, что реализация намеченных плановых заданий позволяет оценить значение существенных финансовых и административных условий. Идейные соображения высшего порядка, а также начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации модели развития. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности в значительной степени обуславливает создание дальнейших направлений развития.
            Задача организации, в особенности же рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании направлений прогрессивного развития. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Значимость этих проблем настолько очевидна, что консультация с широким активом обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия.`
        }
    ],
    favorite: [
        {
            id: 1,
            name: 'Book Number1',
            description: `Разнообразный и богатый опыт укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации. Повседневная практика показывает, что сложившаяся структура организации влечет за собой процесс внедрения и модернизации дальнейших направлений развития. Повседневная практика показывает, что реализация намеченных плановых заданий позволяет оценить значение существенных финансовых и административных условий. Идейные соображения высшего порядка, а также начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации модели развития. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности в значительной степени обуславливает создание дальнейших направлений развития.
            Задача организации, в особенности же рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании направлений прогрессивного развития. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Значимость этих проблем настолько очевидна, что консультация с широким активом обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия.`
        },
        {
            id: 2,
            name: 'Book Number2',
            description: `Разнообразный и богатый опыт укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации. Повседневная практика показывает, что сложившаяся структура организации влечет за собой процесс внедрения и модернизации дальнейших направлений развития. Повседневная практика показывает, что реализация намеченных плановых заданий позволяет оценить значение существенных финансовых и административных условий. Идейные соображения высшего порядка, а также начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации модели развития. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности в значительной степени обуславливает создание дальнейших направлений развития.
            Задача организации, в особенности же рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании направлений прогрессивного развития. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Значимость этих проблем настолько очевидна, что консультация с широким активом обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия.`
        },
        {
            id: 5,
            name: 'Book Number5',
            description: `Разнообразный и богатый опыт укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации. Повседневная практика показывает, что сложившаяся структура организации влечет за собой процесс внедрения и модернизации дальнейших направлений развития. Повседневная практика показывает, что реализация намеченных плановых заданий позволяет оценить значение существенных финансовых и административных условий. Идейные соображения высшего порядка, а также начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации модели развития. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности в значительной степени обуславливает создание дальнейших направлений развития.
            Задача организации, в особенности же рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. Разнообразный и богатый опыт новая модель организационной деятельности играет важную роль в формировании направлений прогрессивного развития. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Значимость этих проблем настолько очевидна, что консультация с широким активом обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия.`
        },
    ]
}

const renderList = () => {
    const listContainer = document.getElementById('book__lists')
    database.list_all.forEach(book => {
        //  Поулчаем корневой элемент, куда будем вставлять последующие айтемы, итерируемые с бд
        const list__books__item = document.createElement('div')
        list__books__item.setAttribute('class', 'list__books__item flex justify-between items-center mb-[20px] hover:bg-[#E8DEDE] transition')
        // Выстраиваю DOM Элементы Item , после буду добавлять в родителя.
        const el_h3 = document.createElement('h3')
        const el_span = document.createElement('span')
        el_h3.setAttribute('class', 'font-bold')
        el_span.textContent = '-'
        el_h3.appendChild(el_span)
        el_h3.textContent = book.name
        const book_actions = document.createElement('div')
        book_actions.setAttribute('class', 'book_actions flex justify-center items-center')
        const buttons__actions = ['Ред.', 'Прочитал', 'Читать', 'Удалить']
        buttons__actions.forEach(action => {
            const button = document.createElement('button')
            if (action === 'Удалить') {
                button.setAttribute('class', 'material-symbols-outlined mr-[5px] border-2 rounded border-black py-[7px] px-[7px] font-bold')
                button.textContent = 'close'
            } else {
                button.setAttribute('class', 'mr-[5px] border-2 rounded border-black py-[7px] px-[7px] font-bold')
                button.textContent = action
            }
            book_actions.appendChild(button)
        })
        // Добавление сформированного ДОМ компонента в родителя
        list__books__item.appendChild(el_h3)
        list__books__item.appendChild(book_actions)
        listContainer.appendChild(list__books__item)

    })
}
const renderFavorite = () => {
    const listContainer = document.getElementById('book__favorite')
    database.favorite.forEach(book => {
        //  Поулчаем корневой элемент, куда будем вставлять последующие айтемы, итерируемые с бд
        const list__books__item = document.createElement('div')
        list__books__item.setAttribute('class', 'list__books__item flex justify-between items-center mb-[20px] hover:bg-[#E8DEDE] transition')
        // Выстраиваю DOM Элементы Item , после буду добавлять в родителя.
        const el_h3 = document.createElement('h3')
        const el_span = document.createElement('span')
        el_h3.setAttribute('class', 'font-bold')
        el_span.textContent = '-'
        el_h3.appendChild(el_span)
        el_h3.textContent = book.name
        const book_actions = document.createElement('div')
        book_actions.setAttribute('class', 'book_actions flex justify-center items-center')
        const buttons__actions = ['Ред.', 'Прочитал', 'Читать', 'Удалить']
        buttons__actions.forEach(action => {
            const button = document.createElement('button')
            if (action === 'Удалить') {
                button.setAttribute('class', 'material-symbols-outlined mr-[5px] border-2 rounded border-black py-[7px] px-[7px] font-bold')
                button.textContent = 'close'
            } else {
                button.setAttribute('class', 'mr-[5px] border-2 rounded border-black py-[7px] px-[7px] font-bold')
                button.textContent = action
            }
            book_actions.appendChild(button)
        })
        // Добавление сформированного ДОМ компонента в родителя
        list__books__item.appendChild(el_h3)
        list__books__item.appendChild(book_actions)
        listContainer.appendChild(list__books__item)

    })
}
const clearList = () => {
    const book__lists = document.getElementById('book__lists')
    book__lists.innerText = ''
}
const onReLoad = () => {
    clearList()
    renderList()
}
const clearForm = () => {
    form__setting.name__input.target_v.value = ''
    form__setting.description_input.target_v.value = ''
}

const onRewriteForm = () => {
    const add_book_button = document.getElementById('add_book')
    const form__information = document.getElementById('form__information')
    form__information.innerText = ''
    const name__book = document.createElement('input')
    name__book.setAttribute('type', 'text')
    name__book.setAttribute('placeholder', 'Заголовок')
    name__book.setAttribute('class', 'border-2 border-black w-full mb-[10px] px-[17px] h-[50px]')
    name__book.setAttribute('id', 'name_book')

    form__setting.name__input.target_v = name__book

    const description__book = document.createElement('textarea')
    description__book.setAttribute('placeholder', 'Описание')
    description__book.setAttribute('class', 'border-2 border-black w-full px-[17px]')
    description__book.setAttribute('id', 'description_book')
    description__book.setAttribute('name', 'description')
    description__book.setAttribute('cols', '30')
    description__book.setAttribute('rows', '5')

    form__setting.description_input.target_v = description__book

    form__information.appendChild(name__book)
    form__information.appendChild(description__book)
    add_book_button.setAttribute('type', 'submit')
    add_book_button.textContent = 'create'
    add_book_button.onclick = (e) => {
        event.preventDefault()
        addBook()
    }
}

const validForm = (args = []) => {
    let result;
    args.forEach(arg => {
        console.log(arg)
        if (arg !== null && arg !== undefined && arg !== '') result = 1
        else result = 0
    })
    return result
}
renderFavorite()
renderList()


const form__setting = {
    check_one: document.getElementById('check_load'),
    check_two: document.getElementById('write_some'),
    name__input: {
        visibility: true,
        target_v: document.getElementById('name_book')
    },
    description_input: {
        visibility: true,
        target_v: document.getElementById('description_book')
    }
}



const check_load = document.getElementById('check_load')
const write_some = document.getElementById('write_some')
check_load.onchange = (e) => mdlwForm(e)
write_some.onchange = (e) => mdlwForm(e)



const mdlwForm = async (v) => {
    const target_id = v.target.id
    const form__information = document.getElementById('form__information')
    const add_book_button = document.getElementById('add_book')
    if (target_id === 'check_load') {

        form__information.innerText = ''
        add_book_button.textContent = 'download file'
        add_book_button.setAttribute('type', 'file')
        // const loadFile = document.createElement('input')
        // loadFile.setAttribute('type', 'file')
        // loadFile.click()
        add_book_button.onload = (e) => {
            console.log('laoded')
            console.log(e)
        }

    } 
    else {
        onRewriteForm()

    }

}


const addBook = () => {
    const generateId = Math.floor(Math.round() * 93821)
    const valueInputs = [form__setting.name__input.target_v.value, form__setting.description_input.target_v.value]
    const [name, description] = valueInputs
    const valid_result = validForm(valueInputs)
    if (valid_result === 0) return console.log(' Missing Param(-s)')
    console.log(valid_result)
    console.log(name, description)
    database.list_all.push({ id: generateId, name, description })
    console.log('Pushed')
    clearForm()
    onReLoad()
}